{
  "titles": {
    "experience": "Experiencia laboral",
    "education": "Educación"
  },

  "subtitles": {
    
  },

  "contents": {
    "dates": {
      "university": "Sep 2014 - Jul 2018",
      "first": "Mar 2018 - Sep 2019",
      "second": "Sep 2019 - Abr 2021",
      "third": "Ago 2021 - Oct 2022",
      "fourth": "Ago 2021 - Oct 2022",
      "fiveth": "May 2023 - Actual"
    },
    "items": {
      "university": "Ingeniero Informático",
      "first": "Programador, 3DAvenue",
      "second": "Programador líder, 3DAvenue",
      "third": "Scrum Master, Coachteen",
      "fourth": "Desarrollador Full-stack, Coachteen",
      "fiveth": "Programador, Freelance"
    },
    "subitems": {
      "university": "Yo estudié en la Universidad Dr. Rafael Belloso Chacín localizada en Maracaibo. Durante este tiempo fui aprendiendo sobre como utilizar lenguajes tales como C++, Java, Visual Basic, Javascript y C#.",
      "first": {
        "one": "Desarrollar el motor de físicas internas del videojuego.",
        "two": "Trabajar en los comportamientos de las entidades expuestas en los requisitos del proyecto y otros sistemas complementarios.",
        "three": "Diseñar herramientas de desarrollo en el entorno de Unity para facilitar la producción del proyecto.",
        "four": "Asegurar el rendimiento y la funcionalidad del videojuego entre diferentes plataformas tales como PC, PlayStation 4, Xbox One y Nintendo Switch."
      },
      "second": {
        "one": "Asistir con soporte técnico al equipo con respecto a las herramientas de trabajo y todos los aspectos creativos del proyecto.",
        "two": "Liderar el desarrollo técnico del proyecto a través de la metodología SCRUM.",
        "three": "Ayudar a establecer las mejores prácticas de desarrollo sobretodo con revisiones periódicas del código del proyecto.",
        "four": "Estimar el tiempo necesario para completar cada tarea de programación y comprometerse a cumplir cada una de ellas."
      },
      "third": {
        "one": "Dirigir el departamento de tecnologías en aplicar las mejores prácticas tales como control de versiones usando git, documentar el proyecto y utilizar la metodología SCRUM.",
        "two": "Mantener el equipo organizado, al día y centrado en los procesos con los cuales ellos podrán completar los objetivos."
      },
      "fourth": {
        "one": "Desarrollar una nueva plataforma educacional inspirada en MOODLE utilizando React.js, Express.js y MongoDB como sus tecnologías principales.",
        "two": "Definir una estructura front-end y back-end siguiendo los estándares de desarrollo que aseguran que la aplicación sea segura, escalable y extensible.",
        "three": "Localizar la interfaz de usuario y maquetación esperada dentro de componentes responsive utilizando Tailwind CSS.",
        "four": "Construir una API siguiendo el patrón RESTful con efectivos protocolos de seguridad, medidas de protección de datos y soluciones de almacenamientos."
      },
      "fiveth": {
        "one": "Crear herramientas de editor en Unity para permitir a los desarrolladores utilizar sistemas complejos de forma sencilla.",
        "two": "Implementar las especificaciones de diseño como características funcionales dentro del juego configurables por el game designer."
      }
    }
  }
}