{
  "titles": {
    "knowledge": "Conocimiento"
  },

  "subtitles": {
    "unity" : "Unity",
    "frontend": "Front-end",
    "backend": "Back-end",
    "methodologies": "Metodologías",
    "skills": "Aptitudes",
    "languages": "Lenguajes",
    "frameworks": "Frameworks",
    "versions": "Control de versiones"
  },

  "contents": {
    "unity" : "Tengo un increible conocimiento en todo lo relacionado a hacer un juego metroidvania, especialmente en desarrollar herramientas en Unity para facilitar la producción del proyecto, además de implementar la inteligencia artificial de los enemigos. También dispongo de conocimiento en hacer juegos multijugador utilizando Photon.",
    "frontend": "Aunque no me considere a mi mismo como Front-end Developer, tengo conocimiento en utilizar React.js y Tailwind.css, especialmente en implementar la maquetación proveida por el diseñador, crear custom hooks para un mejor desarrollo del proyecto y en implementar tecnologías como redux, slate, video.js y i18next.",
    "backend": "A pesar de no disponer de suficiente experiencia, me gustaría decir que soy un Back-end Developer. Tengo conocimiento en desarrollar una estructura back-end utilizando Node.js, Express.js y MongoDB, especialmente en construir una RESTful API con los debidos protocolos de seguridad, además de conectar el back-end con servicios tales como sendgrid, imagekit.io, stripe y paypal.",
    "methodologies": "Yo he trabajado principalmente con la metodología SCRUM en todo proyecto en que he participado. He asistido en implementar esta tecnología en el departamento técnico de una de las empresas, además me he asegurado de que se esten aplicando las mejores prácticas como tener politicas de pull request, la documentación del proyecto y de que cree un nuevo branch por cada feature nuevo a realizar. Para el control de versiones he utilizado servicios como github y bitbucket.",

    "skills": {
      "csharp": "C#",
      "javascript": "Javascript",
      "cplusplus": "C++",
      "mysql": "MySql",
      "mongodb": "MongoDB"
    },

    "languages": {
      "spanish": "Español",
      "english": "Inglés",
      "japanese": "Japonés"
    },

    "levels": {
      "native": "Nativo"
    },

    "frameworks": {
      "unity2d": "Unity2D",
      "unreal": "Unreal Engine",
      "reactjs": "React.js",
      "expressjs": "Express.js"
    },

    "versions": {
      "git": "Git"
    }
  }
}